## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm_module.azurerm_linux_virtual_machine.vm-test will be created
  + resource "azurerm_linux_virtual_machine" "vm-test" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "kmiszel"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "northeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vmtest"
      + network_interface_ids                                  = [
          + "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/rg-modules/providers/Microsoft.Network/networkInterfaces/vmtest-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-modules"
      + secure_boot_enabled                                    = true
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false
      + vtpm_enabled                                           = true

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>